RyanHailey21/esp32_drone/Mission.cpp
        // ── LANDING ──────────────────────────────────────────
        case LANDING: {
            channels[CH_ARM]   = 1800;
            channels[CH_ANGLE] = angleModeChannelValue();
            digitalWrite(STATUS_LED, millis() % 200 < 30);
            if (attitudeAbortActive()) {
                disarmToIdle("[LANDING] attitude abort");
                break;
            }

            // ToF can detect ground immediately. Baro/fused fallback must first
            // show real descent so a stale zero cannot kill motors mid-air.
            float landingAlt = altitude;
            float tofAgl = lastTofValid ? lastTofAltM : altitude;
            bool hasDescended = (landingStartAlt - landingAlt) > 0.3f;
            bool tofGround = lastTofValid && lastTofWeightPct >= 80 && lastTofAltM <= LANDING_GROUND_M;
            bool fallbackGround = !tofGround && hasDescended && landingAlt <= LANDING_GROUND_M;
            bool startedOnGround = landingStartAlt <= LANDING_GROUND_M && landingAlt <= LANDING_GROUND_M;
            if (tofGround || fallbackGround || startedOnGround) {
                disarmToIdle("[LANDING] ground detected");
                break;
            }
            if (millis() - landingStartMs >= LANDING_TIMEOUT_MS) {
                disarmToIdle("[LANDING] timeout");
                break;
            }

            float predictedLandingAlt = max(0.0f, landingAlt + filteredVario * LANDING_LOOKAHEAD_S);
            float targetDescentMps = DESCENT_RATE_MPS;
            float landingOffsetUs = LANDING_THROTTLE_OFFSET_US;
            if (predictedLandingAlt <= LANDING_FINAL_ALT_M) {
                targetDescentMps = LANDING_FINAL_DESCENT_MPS;
                landingOffsetUs = LANDING_FINAL_OFFSET_US;
            } else if (predictedLandingAlt <= LANDING_FLARE_ALT_M) {
                float u = (predictedLandingAlt - LANDING_FINAL_ALT_M) / (LANDING_FLARE_ALT_M - LANDING_FINAL_ALT_M);
                targetDescentMps = LANDING_FINAL_DESCENT_MPS
                    + u * (LANDING_FLARE_DESCENT_MPS - LANDING_FINAL_DESCENT_MPS);
                landingOffsetUs = LANDING_FINAL_OFFSET_US
                    + u * (LANDING_FLARE_OFFSET_US - LANDING_FINAL_OFFSET_US);
            }

            uint32_t landingElapsedMs = millis() - landingStartMs;
            if (landingElapsedMs < LANDING_ENTRY_RAMP_MS) {
                float ramp = landingElapsedMs / (float)LANDING_ENTRY_RAMP_MS;
                landingOffsetUs = LANDING_ENTRY_START_OFFSET_US
                    + ramp * (landingOffsetUs - LANDING_ENTRY_START_OFFSET_US);
            }

            float rateError           = (-targetDescentMps) - filteredVario;
            int16_t correction        = (int16_t)(LANDING_KP_VSPEED * rateError);
            float landingBaseThrottle = max((float)MIN_ALT_HOLD_THROTTLE_US,
                                            (float)HOVER_THROTTLE - landingOffsetUs);
            float landingRawThrottle  = landingBaseThrottle + correction;
            float landingMinThrottle  = max(1000.0f, (float)HOVER_THROTTLE - (float)LANDING_MIN_BELOW_HOVER_US);
            if (predictedLandingAlt <= LANDING_LOW_ALT_FLOOR_M && filteredVario < -LANDING_FINAL_DESCENT_MPS) {
                float descentMps = -filteredVario;
                float speedU = (descentMps - LANDING_FINAL_DESCENT_MPS)
                    / (LANDING_FAST_DESCENT_MPS - LANDING_FINAL_DESCENT_MPS);
                speedU = constrain(speedU, 0.0f, 1.0f);
                float floorOffsetUs = LANDING_LOW_ALT_MIN_OFFSET_US
                    + speedU * (LANDING_FAST_DESCENT_MIN_OFFSET_US - LANDING_LOW_ALT_MIN_OFFSET_US);
                landingMinThrottle = max(landingMinThrottle, (float)HOVER_THROTTLE - floorOffsetUs);
            }
            float landingMaxThrottle  = (float)HOVER_THROTTLE + 80.0f;
            channels[CH_THROTTLE]     = (uint16_t)constrain(landingRawThrottle, landingMinThrottle, landingMaxThrottle);
            lastAltError = 0.0f;
            lastDesiredVspeed = -targetDescentMps;
            lastVspeedError = rateError;
            lastControlPUs = correction;
            lastControlIUs = 0.0f;
            lastRawThrottle = landingRawThrottle;
            lastThrMin = landingMinThrottle;
            lastThrMax = landingMaxThrottle;
            lastClampedThrottle = channels[CH_THROTTLE];
            lastThrottleSat = landingRawThrottle > landingMaxThrottle ? 1 : (landingRawThrottle < landingMinThrottle ? -1 : 0);
            sendRC();
            logFlightSample(millis() - landingStartMs, "landing", landingAlt, landingAlt, channels[CH_THROTTLE]);

#if SERIAL_FLIGHT_DEBUG
            Serial.printf("[LANDING] alt=%.2fm  tof=%.2f  filtV=%.2f  thr=%d\n",
                landingAlt, tofAgl, filteredVario, channels[CH_THROTTLE]);
#endif
            break;
        }

        case DONE:
            sendRC();
            digitalWrite(STATUS_LED, millis() % 100 < 50);
            break;
    }
}
